tests/k6/results/roadmap/after-optimization/roadmap-progress-summary.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/roadmap/roadmap-progress.test.js
        output: -

     scenarios: (100.00%) 1 scenario, 3 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 3 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 3/3 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 3 VUs  00.9s/30s

running (0m02.0s), 3/3 VUs, 3 complete and 0 interrupted iterations
default   [   6% ] 3 VUs  01.9s/30s

running (0m03.0s), 3/3 VUs, 6 complete and 0 interrupted iterations
default   [  10% ] 3 VUs  02.9s/30s

running (0m04.0s), 3/3 VUs, 9 complete and 0 interrupted iterations
default   [  13% ] 3 VUs  03.9s/30s

running (0m05.0s), 3/3 VUs, 12 complete and 0 interrupted iterations
default   [  16% ] 3 VUs  04.9s/30s

running (0m06.0s), 3/3 VUs, 15 complete and 0 interrupted iterations
default   [  20% ] 3 VUs  05.9s/30s

running (0m07.0s), 3/3 VUs, 18 complete and 0 interrupted iterations
default   [  23% ] 3 VUs  06.9s/30s

running (0m08.0s), 3/3 VUs, 21 complete and 0 interrupted iterations
default   [  26% ] 3 VUs  07.9s/30s

running (0m09.0s), 3/3 VUs, 24 complete and 0 interrupted iterations
default   [  30% ] 3 VUs  08.9s/30s

running (0m10.0s), 3/3 VUs, 27 complete and 0 interrupted iterations
default   [  33% ] 3 VUs  09.9s/30s

running (0m11.0s), 3/3 VUs, 30 complete and 0 interrupted iterations
default   [  36% ] 3 VUs  10.9s/30s

running (0m12.0s), 3/3 VUs, 33 complete and 0 interrupted iterations
default   [  40% ] 3 VUs  11.9s/30s

running (0m13.0s), 3/3 VUs, 36 complete and 0 interrupted iterations
default   [  43% ] 3 VUs  12.9s/30s

running (0m14.0s), 3/3 VUs, 39 complete and 0 interrupted iterations
default   [  46% ] 3 VUs  13.9s/30s

running (0m15.0s), 3/3 VUs, 42 complete and 0 interrupted iterations
default   [  50% ] 3 VUs  14.9s/30s

running (0m16.0s), 3/3 VUs, 45 complete and 0 interrupted iterations
default   [  53% ] 3 VUs  15.9s/30s

running (0m17.0s), 3/3 VUs, 48 complete and 0 interrupted iterations
default   [  56% ] 3 VUs  16.9s/30s

running (0m18.0s), 3/3 VUs, 51 complete and 0 interrupted iterations
default   [  60% ] 3 VUs  17.9s/30s

running (0m19.0s), 3/3 VUs, 54 complete and 0 interrupted iterations
default   [  63% ] 3 VUs  18.9s/30s

running (0m20.0s), 3/3 VUs, 57 complete and 0 interrupted iterations
default   [  66% ] 3 VUs  19.9s/30s

running (0m21.0s), 3/3 VUs, 60 complete and 0 interrupted iterations
default   [  70% ] 3 VUs  20.9s/30s

running (0m22.0s), 3/3 VUs, 63 complete and 0 interrupted iterations
default   [  73% ] 3 VUs  21.9s/30s

running (0m23.0s), 3/3 VUs, 66 complete and 0 interrupted iterations
default   [  76% ] 3 VUs  22.9s/30s

running (0m24.0s), 3/3 VUs, 69 complete and 0 interrupted iterations
default   [  80% ] 3 VUs  23.9s/30s

running (0m25.0s), 3/3 VUs, 72 complete and 0 interrupted iterations
default   [  83% ] 3 VUs  24.9s/30s

running (0m26.0s), 3/3 VUs, 75 complete and 0 interrupted iterations
default   [  86% ] 3 VUs  25.9s/30s

running (0m27.0s), 3/3 VUs, 78 complete and 0 interrupted iterations
default   [  90% ] 3 VUs  26.9s/30s

running (0m28.0s), 3/3 VUs, 81 complete and 0 interrupted iterations
default   [  93% ] 3 VUs  27.9s/30s

running (0m29.0s), 3/3 VUs, 84 complete and 0 interrupted iterations
default   [  96% ] 3 VUs  28.9s/30s

running (0m30.0s), 3/3 VUs, 87 complete and 0 interrupted iterations
default   [ 100% ] 3 VUs  29.9s/30s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<1000' p(95)=13.52ms

    http_req_failed
    Γ£ô 'rate<0.02' rate=0.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 183     5.921463/s
    checks_succeeded...: 100.00% 183 out of 183
    checks_failed......: 0.00%   0 out of 183

    Γ£ô login status is 200
    Γ£ô login returned cookies
    Γ£ô setup graph status is 200
    Γ£ô progress in_progress status is 200
    Γ£ô progress completed status is 200

    HTTP
    http_req_duration..............: avg=13.42ms min=6.39ms med=8.71ms max=227.86ms p(90)=12.67ms p(95)=13.52ms
      { expected_response:true }...: avg=13.42ms min=6.39ms med=8.71ms max=227.86ms p(90)=12.67ms p(95)=13.52ms
    http_req_failed................: 0.00%  0 out of 182
    http_reqs......................: 182    5.889105/s

    EXECUTION
    iteration_duration.............: avg=1.02s   min=1.01s  med=1.01s  max=1.24s    p(90)=1.02s   p(95)=1.02s  
    iterations.....................: 90     2.912195/s
    vus............................: 3      min=3        max=3
    vus_max........................: 3      min=3        max=3

    NETWORK
    data_received..................: 342 kB 11 kB/s
    data_sent......................: 27 kB  875 B/s



running (0m30.9s), 0/3 VUs, 90 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 3 VUs  30s