tests/k6/results/roadmap/after-optimization/roadmap-read-summary.txt

         /\      Grafana   /ΓÇ╛ΓÇ╛/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ΓÇ╛ΓÇ╛\ 
  /          \   |   (  |  (ΓÇ╛)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/performance/k6/roadmap/roadmap-read.test.js
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 5 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 5/5 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 5 VUs  00.8s/30s

running (0m02.0s), 5/5 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 5 VUs  01.8s/30s

running (0m03.0s), 5/5 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 5 VUs  02.8s/30s

running (0m04.0s), 5/5 VUs, 15 complete and 0 interrupted iterations
default   [  13% ] 5 VUs  03.8s/30s

running (0m05.0s), 5/5 VUs, 20 complete and 0 interrupted iterations
default   [  16% ] 5 VUs  04.8s/30s

running (0m06.0s), 5/5 VUs, 25 complete and 0 interrupted iterations
default   [  19% ] 5 VUs  05.8s/30s

running (0m07.0s), 5/5 VUs, 30 complete and 0 interrupted iterations
default   [  23% ] 5 VUs  06.8s/30s

running (0m08.0s), 5/5 VUs, 35 complete and 0 interrupted iterations
default   [  26% ] 5 VUs  07.8s/30s

running (0m09.0s), 5/5 VUs, 40 complete and 0 interrupted iterations
default   [  29% ] 5 VUs  08.8s/30s

running (0m10.0s), 5/5 VUs, 45 complete and 0 interrupted iterations
default   [  33% ] 5 VUs  09.8s/30s

running (0m11.0s), 5/5 VUs, 50 complete and 0 interrupted iterations
default   [  36% ] 5 VUs  10.8s/30s

running (0m12.0s), 5/5 VUs, 55 complete and 0 interrupted iterations
default   [  39% ] 5 VUs  11.8s/30s

running (0m13.0s), 5/5 VUs, 56 complete and 0 interrupted iterations
default   [  43% ] 5 VUs  12.8s/30s

running (0m14.0s), 5/5 VUs, 61 complete and 0 interrupted iterations
default   [  46% ] 5 VUs  13.8s/30s

running (0m15.0s), 5/5 VUs, 66 complete and 0 interrupted iterations
default   [  49% ] 5 VUs  14.8s/30s

running (0m16.0s), 5/5 VUs, 71 complete and 0 interrupted iterations
default   [  53% ] 5 VUs  15.8s/30s

running (0m17.0s), 5/5 VUs, 75 complete and 0 interrupted iterations
default   [  56% ] 5 VUs  16.8s/30s

running (0m18.0s), 5/5 VUs, 80 complete and 0 interrupted iterations
default   [  59% ] 5 VUs  17.8s/30s

running (0m19.0s), 5/5 VUs, 85 complete and 0 interrupted iterations
default   [  63% ] 5 VUs  18.8s/30s

running (0m20.0s), 5/5 VUs, 90 complete and 0 interrupted iterations
default   [  66% ] 5 VUs  19.8s/30s

running (0m21.0s), 5/5 VUs, 95 complete and 0 interrupted iterations
default   [  69% ] 5 VUs  20.8s/30s

running (0m22.0s), 5/5 VUs, 100 complete and 0 interrupted iterations
default   [  73% ] 5 VUs  21.8s/30s

running (0m23.0s), 5/5 VUs, 105 complete and 0 interrupted iterations
default   [  76% ] 5 VUs  22.8s/30s

running (0m24.0s), 5/5 VUs, 110 complete and 0 interrupted iterations
default   [  79% ] 5 VUs  23.8s/30s

running (0m25.0s), 5/5 VUs, 115 complete and 0 interrupted iterations
default   [  83% ] 5 VUs  24.8s/30s

running (0m26.0s), 5/5 VUs, 120 complete and 0 interrupted iterations
default   [  86% ] 5 VUs  25.8s/30s

running (0m27.0s), 5/5 VUs, 125 complete and 0 interrupted iterations
default   [  89% ] 5 VUs  26.8s/30s

running (0m28.0s), 5/5 VUs, 130 complete and 0 interrupted iterations
default   [  93% ] 5 VUs  27.8s/30s

running (0m29.0s), 5/5 VUs, 135 complete and 0 interrupted iterations
default   [  96% ] 5 VUs  28.8s/30s

running (0m30.0s), 5/5 VUs, 140 complete and 0 interrupted iterations
default   [  99% ] 5 VUs  29.8s/30s

running (0m31.0s), 4/5 VUs, 141 complete and 0 interrupted iterations
default Γåô [ 100% ] 5 VUs  30s


  Γûê THRESHOLDS 

    http_req_duration
    Γ£ô 'p(95)<800' p(95)=46.98ms

    http_req_failed
    Γ£ô 'rate<0.01' rate=0.00%


  Γûê TOTAL RESULTS 

    checks_total.......: 1016    32.73694/s
    checks_succeeded...: 100.00% 1016 out of 1016
    checks_failed......: 0.00%   0 out of 1016

    Γ£ô setup graph status is 200
    Γ£ô list status is 200
    Γ£ô list returns body
    Γ£ô graph status is 200
    Γ£ô graph has nodes
    Γ£ô graph has edges field
    Γ£ô node detail status is 200
    Γ£ô node detail returns body

    HTTP
    http_req_duration..............: avg=19.28ms min=4.49ms med=8.82ms max=178.54ms p(90)=42.06ms p(95)=46.98ms
      { expected_response:true }...: avg=19.28ms min=4.49ms med=8.82ms max=178.54ms p(90)=42.06ms p(95)=46.98ms
    http_req_failed................: 0.00%  0 out of 436
    http_reqs......................: 436    14.048529/s

    EXECUTION
    iteration_duration.............: avg=1.06s   min=1.03s  med=1.05s  max=1.16s    p(90)=1.06s   p(95)=1.07s  
    iterations.....................: 145    4.672103/s
    vus............................: 4      min=4        max=5
    vus_max........................: 5      min=5        max=5

    NETWORK
    data_received..................: 30 MB  976 kB/s
    data_sent......................: 126 kB 4.1 kB/s



running (0m31.0s), 0/5 VUs, 145 complete and 0 interrupted iterations
default Γ£ô [ 100% ] 5 VUs  30s